{
  "backend/main.mo": "Actor defines asset, position, and metrics types, stores positions and scenario steps, and provides functions to add data and compute risk and yield metrics.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including simulation, market data, and UI views.",
  "frontend/index.css": "Global Tailwind-based OKLCH grayscale theme with light/dark variables and shared styling tokens.",
  "frontend/index.html": "Basic HTML shell that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Main application shell with tab navigation integrating strategy, simulation, risk, returns, LP, staking, and learning views.",
  "frontend/src/features/learning/LearningGuidanceView.tsx": "Learning guidance UI that generates personalized insights and manages user-added learning resource links using local storage.",
  "frontend/src/features/lp/LpCalculatorView.tsx": "React UI for an LP calculator that gathers inputs, computes LP vs hold values using lpMath helpers, and displays results.",
  "frontend/src/features/lp/lpMath.ts": "Pure math utilities for LP calculations including impermanent loss, LP vs hold comparison, fee estimation, and net outcome.",
  "frontend/src/features/returns/ReturnsBreakdownView.tsx": "Displays deposit interest, borrow interest, net return, and APR/APY based on simulation state.",
  "frontend/src/features/risk/RiskMetricsView.tsx": "Shows risk metrics such as health factor and liquidation risk, with interactive price‑shock controls.",
  "frontend/src/features/simulator/ScenarioSimulatorView.tsx": "UI for configuring and running strategy simulations, then displaying summarized simulation results.",
  "frontend/src/features/staking/StakingCalculatorView.tsx": "React UI for a staking calculator that handles inputs, compounding options, lockup periods, and displays calculated results.",
  "frontend/src/features/staking/stakingMath.ts": "Pure helper functions for simple and compounded staking rewards, lockup handling, and compounding frequency comparisons.",
  "frontend/src/features/strategy/StrategyBuilderView.tsx": "UI for building DeFi strategies by selecting protocols, loading market data, and adding deposit or borrow positions.",
  "frontend/src/guidance/generateGuidance.ts": "Generates textual guidance from risk and return results, producing risk analysis, suggestions, and insights.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for positions, portfolio data, risk metrics, yield metrics, and market data source updates.",
  "frontend/src/index.css": "Defines Tailwind layers and global CSS variables for light and dark grayscale themes, plus basic typography and focus styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/market-data/adapters.ts": "Loads sample or live DeFi market data with error handling and exports a unified fetch function.",
  "frontend/src/market-data/sample/aave.sample.json": "Provides static sample Aave asset data including prices, rates, and liquidation thresholds.",
  "frontend/src/market-data/sample/compound.sample.json": "Provides static sample Compound asset data including prices, rates, and liquidation thresholds.",
  "frontend/src/services/learningLinksStore.ts": "Manages stored learning links using localStorage with defaults and safe load/save functions.",
  "frontend/src/simulation/engine.ts": "Runs multi‑day simulations applying price shocks, interest accrual, health factor, and liquidation calculations.",
  "frontend/src/simulation/returns.ts": "Calculates deposit and borrow interest, net returns, APR, APY, and per‑asset breakdowns.",
  "frontend/src/simulation/risk.ts": "Computes risk metrics including health factor, collateral ratio, liquidation price, and risk level under a price shock.",
  "frontend/src/simulation/types.ts": "Defines shared TypeScript interfaces for positions, configs, simulation results, risk results, and return data.",
  "frontend/src/state/useSimulatorState.ts": "Zustand store managing positions, protocol selection, inputs, and generating simulation, risk, and return results.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling class-based dark mode, custom colors, typography, animations, and plugin support. Extends theme with OKLCH color variables, shadows, fonts, and accordion animations.",
  "project_state.json": "Tracks the project's current state, goals, architecture notes, issues, and existing features for a DeFi investment simulator. Includes schema versioning and flags ongoing fix requests."
}